Tests/sysbench_results_c7g.xlarge_20250605_040953.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Thu Jun  5 04:09:54 UTC 2025
Hostname: ip-172-28-34-204.8067.aws-int.thomsonreuters.com
Instance Type: c7g.xlarge
Operating System: Linux ip-172-28-34-204.8067.aws-int.thomsonreuters.com 6.1.131-143.221.amzn2023.aarch64 #1 SMP Mon Mar 24 15:34:49 UTC 2025 aarch64 aarch64 aarch64 GNU/Linux
CPU Info: AWS Graviton3
CPU Cores: 4
Memory: 7.6Gi
=====================================================================

[2025-06-05 04:09:54] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-05 04:09:54] Results will be saved to: sysbench_results_c7g.xlarge_20250605_040953.txt
[2025-06-05 04:09:54] ================================================
[2025-06-05 04:09:54] Checking prerequisites...
[2025-06-05 04:09:54] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-05 04:09:54] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-05 04:09:54] Starting CPU benchmarks...
[2025-06-05 04:09:54] Detected 4 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 04:09:54] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 28431.86 lat (ms,95%): 0.04
[ 20s ] thds: 1 eps: 28430.59 lat (ms,95%): 0.04
[ 30s ] thds: 1 eps: 28456.13 lat (ms,95%): 0.04
[ 40s ] thds: 1 eps: 28422.87 lat (ms,95%): 0.04
[ 50s ] thds: 1 eps: 28501.08 lat (ms,95%): 0.04
[ 60s ] thds: 1 eps: 28504.44 lat (ms,95%): 0.04
[ 70s ] thds: 1 eps: 28508.48 lat (ms,95%): 0.04
[ 80s ] thds: 1 eps: 28508.08 lat (ms,95%): 0.04
[ 90s ] thds: 1 eps: 28511.15 lat (ms,95%): 0.04
[ 100s ] thds: 1 eps: 28513.90 lat (ms,95%): 0.04
[ 110s ] thds: 1 eps: 28515.97 lat (ms,95%): 0.04
CPU speed:
    events per second: 28484.58

Throughput:
    events/s (eps):                      28484.5839
    time elapsed:                        120.0005s
    total number of events:              3418164

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                    5.56
         95th percentile:                        0.04
         sum:                               119619.92

Threads fairness:
    events (avg/stddev):           3418164.0000/0.00
    execution time (avg/stddev):   119.6199/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 04:11:54] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 4 eps: 112920.26 lat (ms,95%): 0.04
[ 20s ] thds: 4 eps: 112254.91 lat (ms,95%): 0.04
[ 30s ] thds: 4 eps: 112940.52 lat (ms,95%): 0.04
[ 40s ] thds: 4 eps: 113020.55 lat (ms,95%): 0.04
[ 50s ] thds: 4 eps: 112958.72 lat (ms,95%): 0.04
[ 60s ] thds: 4 eps: 112932.51 lat (ms,95%): 0.04
[ 70s ] thds: 4 eps: 112972.75 lat (ms,95%): 0.04
[ 80s ] thds: 4 eps: 112244.93 lat (ms,95%): 0.04
[ 90s ] thds: 4 eps: 112998.39 lat (ms,95%): 0.04
[ 100s ] thds: 4 eps: 113008.14 lat (ms,95%): 0.04
[ 110s ] thds: 4 eps: 112839.34 lat (ms,95%): 0.04
CPU speed:
    events per second: 112820.26

Throughput:
    events/s (eps):                      112820.2598
    time elapsed:                        120.0002s
    total number of events:              13538454

Latency (ms):
         min:                                    0.03
         avg:                                    0.04
         max:                                   22.21
         95th percentile:                        0.04
         sum:                               478479.44

Threads fairness:
    events (avg/stddev):           3384613.5000/22927.86
    execution time (avg/stddev):   119.6199/0.00

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-05 04:13:54] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-05 04:13:54] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-05 04:15:37] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 04:15:37] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 2990.56 qps: 47852.76 (r/w/o: 41871.24/0.00/5981.52) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 3006.66 qps: 48107.23 (r/w/o: 42093.90/0.00/6013.33) lat (ms,95%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 3235.70 qps: 51770.21 (r/w/o: 45298.81/0.00/6471.40) lat (ms,95%): 1.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 3162.09 qps: 50594.78 (r/w/o: 44270.59/0.00/6324.18) lat (ms,95%): 1.67 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 2837.31 qps: 45397.50 (r/w/o: 39722.89/0.00/5674.61) lat (ms,95%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 3212.80 qps: 51402.79 (r/w/o: 44977.19/0.00/6425.60) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 3154.10 qps: 50465.36 (r/w/o: 44157.16/0.00/6308.19) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 3143.60 qps: 50298.82 (r/w/o: 44011.62/0.00/6287.20) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 3282.40 qps: 52516.73 (r/w/o: 45951.93/0.00/6564.80) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 3269.00 qps: 52304.62 (r/w/o: 45766.63/0.00/6537.99) lat (ms,95%): 1.32 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 3087.40 qps: 49398.97 (r/w/o: 43224.16/0.00/6174.81) lat (ms,95%): 2.03 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 3299.29 qps: 52789.72 (r/w/o: 46191.15/0.00/6598.58) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5275424
        write:                           0
        other:                           753632
        total:                           6029056
    transactions:                        376816 (3140.07 per sec.)
    queries:                             6029056 (50241.16 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3140.0725
    time elapsed:                        120.0023s
    total number of events:              376816

Latency (ms):
         min:                                    0.74
         avg:                                    1.27
         max:                                   23.43
         95th percentile:                        1.76
         sum:                               479587.15

Threads fairness:
    events (avg/stddev):           94204.0000/1378.63
    execution time (avg/stddev):   119.8968/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 04:17:37] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 904.61 qps: 5429.68 (r/w/o: 0.00/3620.05/1809.63) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 705.80 qps: 4234.82 (r/w/o: 0.00/2823.21/1411.61) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 491.60 qps: 2949.60 (r/w/o: 0.00/1966.40/983.20) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 728.40 qps: 4370.40 (r/w/o: 0.00/2913.60/1456.80) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 462.30 qps: 2773.80 (r/w/o: 0.00/1849.20/924.60) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 743.00 qps: 4457.50 (r/w/o: 0.00/2971.50/1486.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 457.50 qps: 2745.50 (r/w/o: 0.00/1830.50/915.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 764.50 qps: 4587.00 (r/w/o: 0.00/3058.00/1529.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 449.50 qps: 2697.00 (r/w/o: 0.00/1798.00/899.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 745.80 qps: 4474.81 (r/w/o: 0.00/2983.20/1491.60) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 464.80 qps: 2788.80 (r/w/o: 0.00/1859.20/929.60) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 725.70 qps: 4354.20 (r/w/o: 0.00/2902.80/1451.40) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           305760
        other:                           152880
        total:                           458640
    transactions:                        76440  (636.98 per sec.)
    queries:                             458640 (3821.88 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      636.9807
    time elapsed:                        120.0036s
    total number of events:              76440

Latency (ms):
         min:                                    1.27
         avg:                                    6.28
         max:                                  177.31
         95th percentile:                       27.66
         sum:                               479894.55

Threads fairness:
    events (avg/stddev):           19110.0000/2.74
    execution time (avg/stddev):   119.9736/0.00

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 04:19:37] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 240.26 qps: 4812.80 (r/w/o: 3369.24/962.64/480.92) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 184.60 qps: 3692.01 (r/w/o: 2584.41/738.40/369.20) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 494.70 qps: 9892.99 (r/w/o: 6925.59/1978.00/989.40) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 215.60 qps: 4313.00 (r/w/o: 3018.60/863.20/431.20) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 463.70 qps: 9271.06 (r/w/o: 6490.07/1853.59/927.40) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 375.90 qps: 7520.91 (r/w/o: 5264.31/1504.80/751.80) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 234.10 qps: 4682.01 (r/w/o: 3277.41/936.40/468.20) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 713.20 qps: 14261.59 (r/w/o: 9983.59/2851.60/1426.40) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 242.50 qps: 4852.37 (r/w/o: 3396.18/971.19/485.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 374.10 qps: 7480.51 (r/w/o: 5236.30/1496.00/748.20) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 673.80 qps: 13477.58 (r/w/o: 9434.35/2695.62/1347.61) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 155.00 qps: 3100.00 (r/w/o: 2170.00/620.00/310.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            611506
        write:                           174716
        other:                           87358
        total:                           873580
    transactions:                        43679  (363.91 per sec.)
    queries:                             873580 (7278.19 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      363.9095
    time elapsed:                        120.0271s
    total number of events:              43679

Latency (ms):
         min:                                    2.00
         avg:                                   10.99
         max:                                  233.75
         95th percentile:                       33.12
         sum:                               479964.67

Threads fairness:
    events (avg/stddev):           10919.7500/16.24
    execution time (avg/stddev):   119.9912/0.01

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-05 04:21:38] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            683345
        write:                           0
        other:                           0
        total:                           683345
    transactions:                        683345 (68330.67 per sec.)
    queries:                             683345 (68330.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      68330.6704
    time elapsed:                        10.0006s
    total number of events:              683345

Latency (ms):
         min:                                    0.03
         avg:                                    0.06
         max:                                   19.54
         95th percentile:                        0.09
         sum:                                39824.94

Threads fairness:
    events (avg/stddev):           170836.2500/4287.19
    execution time (avg/stddev):   9.9562/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-05 04:21:48] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           17393
        other:                           0
        total:                           17393
    transactions:                        17393  (1732.27 per sec.)
    queries:                             17393  (1732.27 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1732.2744
    time elapsed:                        10.0406s
    total number of events:              17393

Latency (ms):
         min:                                    0.91
         avg:                                    2.31
         max:                                   43.72
         95th percentile:                        2.76
         sum:                                40112.07

Threads fairness:
    events (avg/stddev):           4348.2500/0.83
    execution time (avg/stddev):   10.0280/0.01

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-05 04:21:58] Starting K6 benchmarks...
[2025-06-05 04:21:58] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-05 04:21:58] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 6093 complete and 0 interrupted iterations
default   [   6% ] 80 VUs  00m01.0s/10m0s  006093/100000 shared iters

running (00m02.0s), 80/80 VUs, 15110 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m02.0s/10m0s  015110/100000 shared iters

running (00m03.0s), 80/80 VUs, 23907 complete and 0 interrupted iterations
default   [  24% ] 80 VUs  00m03.0s/10m0s  023907/100000 shared iters

running (00m04.0s), 80/80 VUs, 32666 complete and 0 interrupted iterations
default   [  33% ] 80 VUs  00m04.0s/10m0s  032666/100000 shared iters

running (00m05.0s), 80/80 VUs, 41488 complete and 0 interrupted iterations
default   [  41% ] 80 VUs  00m05.0s/10m0s  041488/100000 shared iters

running (00m06.0s), 80/80 VUs, 50501 complete and 0 interrupted iterations
default   [  51% ] 80 VUs  00m06.0s/10m0s  050501/100000 shared iters

running (00m07.0s), 80/80 VUs, 59689 complete and 0 interrupted iterations
default   [  60% ] 80 VUs  00m07.0s/10m0s  059689/100000 shared iters

running (00m08.0s), 80/80 VUs, 68726 complete and 0 interrupted iterations
default   [  69% ] 80 VUs  00m08.0s/10m0s  068726/100000 shared iters

running (00m09.0s), 80/80 VUs, 77676 complete and 0 interrupted iterations
default   [  78% ] 80 VUs  00m09.0s/10m0s  077676/100000 shared iters

running (00m10.0s), 80/80 VUs, 86689 complete and 0 interrupted iterations
default   [  87% ] 80 VUs  00m10.0s/10m0s  086689/100000 shared iters

running (00m11.0s), 80/80 VUs, 95712 complete and 0 interrupted iterations
default   [  96% ] 80 VUs  00m11.0s/10m0s  095712/100000 shared iters
time="2025-06-05T04:22:09Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T04:22:09Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=19.25ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  8712.791646/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=8.97ms min=328.89µs med=7.5ms  max=229.92ms p(90)=15.38ms p(95)=19.25ms
      { endpoint:postgres_insert }..............................................: avg=8.97ms min=328.89µs med=7.5ms  max=229.92ms p(90)=15.38ms p(95)=19.25ms
      { expected_response:true }................................................: avg=8.97ms min=328.89µs med=7.5ms  max=229.92ms p(90)=15.38ms p(95)=19.25ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 8712.878774/s

    EXECUTION
    iteration_duration..........................................................: avg=9.13ms min=391.6µs  med=7.64ms max=239.39ms p(90)=15.64ms p(95)=19.48ms
    iterations..................................................................: 100000 8712.791646/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 802 kB/s
    data_sent...................................................................: 26 MB  2.3 MB/s



running (00m11.5s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m11.4s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-05 04:22:10] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T04:22:10Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T04:22:10Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 8957 complete and 0 interrupted iterations
default   [   9% ] 80 VUs  00m00.9s/10m0s  008957/100000 shared iters

running (00m02.0s), 80/80 VUs, 18473 complete and 0 interrupted iterations
default   [  18% ] 80 VUs  00m01.9s/10m0s  018473/100000 shared iters

running (00m03.0s), 80/80 VUs, 28130 complete and 0 interrupted iterations
default   [  28% ] 80 VUs  00m02.9s/10m0s  028130/100000 shared iters

running (00m04.0s), 80/80 VUs, 37786 complete and 0 interrupted iterations
default   [  38% ] 80 VUs  00m03.9s/10m0s  037786/100000 shared iters

running (00m05.0s), 80/80 VUs, 47853 complete and 0 interrupted iterations
default   [  48% ] 80 VUs  00m04.9s/10m0s  047853/100000 shared iters

running (00m06.0s), 80/80 VUs, 57864 complete and 0 interrupted iterations
default   [  58% ] 80 VUs  00m05.9s/10m0s  057864/100000 shared iters

running (00m07.0s), 80/80 VUs, 67902 complete and 0 interrupted iterations
default   [  68% ] 80 VUs  00m06.9s/10m0s  067902/100000 shared iters

running (00m08.0s), 80/80 VUs, 77663 complete and 0 interrupted iterations
default   [  78% ] 80 VUs  00m07.9s/10m0s  077663/100000 shared iters

running (00m09.0s), 80/80 VUs, 87561 complete and 0 interrupted iterations
default   [  88% ] 80 VUs  00m08.9s/10m0s  087562/100000 shared iters

running (00m10.0s), 80/80 VUs, 97596 complete and 0 interrupted iterations
default   [  98% ] 80 VUs  00m09.9s/10m0s  097596/100000 shared iters
time="2025-06-05T04:22:20Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T04:22:20Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=15.27ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  29320.7072/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=7.9ms  min=288.27µs med=7.13ms max=44.2ms  p(90)=12.64ms p(95)=15.27ms
      { endpoint:postgres_get }.............................................: avg=7.91ms min=288.27µs med=7.14ms max=44.2ms  p(90)=12.64ms p(95)=15.27ms
      { expected_response:true }............................................: avg=7.9ms  min=288.27µs med=7.13ms max=44.2ms  p(90)=12.64ms p(95)=15.27ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 9783.440371/s

    EXECUTION
    iteration_duration......................................................: avg=8.11ms min=352.33µs med=7.27ms max=44.28ms p(90)=13.11ms p(95)=15.85ms
    iterations..............................................................: 100000 9773.569067/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  2.1 MB/s
    data_sent...............................................................: 13 MB  1.3 MB/s



running (00m10.2s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m10.2s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-05 04:22:20] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 2958 complete and 0 interrupted iterations
default   [   3% ] 80 VUs  00m01.0s/10m0s  002958/100000 shared iters

running (00m02.0s), 80/80 VUs, 9124 complete and 0 interrupted iterations
default   [   9% ] 80 VUs  00m02.0s/10m0s  009124/100000 shared iters

running (00m03.0s), 80/80 VUs, 15385 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m03.0s/10m0s  015385/100000 shared iters

running (00m04.0s), 80/80 VUs, 21934 complete and 0 interrupted iterations
default   [  22% ] 80 VUs  00m04.0s/10m0s  021934/100000 shared iters

running (00m05.0s), 80/80 VUs, 28646 complete and 0 interrupted iterations
default   [  29% ] 80 VUs  00m05.0s/10m0s  028646/100000 shared iters

running (00m06.0s), 80/80 VUs, 36177 complete and 0 interrupted iterations
default   [  36% ] 80 VUs  00m06.0s/10m0s  036177/100000 shared iters

running (00m07.0s), 80/80 VUs, 44355 complete and 0 interrupted iterations
default   [  44% ] 80 VUs  00m07.0s/10m0s  044355/100000 shared iters

running (00m08.0s), 80/80 VUs, 52948 complete and 0 interrupted iterations
default   [  53% ] 80 VUs  00m08.0s/10m0s  052948/100000 shared iters

running (00m09.0s), 80/80 VUs, 61540 complete and 0 interrupted iterations
default   [  62% ] 80 VUs  00m09.0s/10m0s  061540/100000 shared iters

running (00m10.0s), 80/80 VUs, 70452 complete and 0 interrupted iterations
default   [  70% ] 80 VUs  00m10.0s/10m0s  070452/100000 shared iters

running (00m11.0s), 80/80 VUs, 79243 complete and 0 interrupted iterations
default   [  79% ] 80 VUs  00m11.0s/10m0s  079243/100000 shared iters

running (00m12.0s), 80/80 VUs, 88196 complete and 0 interrupted iterations
default   [  88% ] 80 VUs  00m12.0s/10m0s  088196/100000 shared iters

running (00m13.0s), 80/80 VUs, 97035 complete and 0 interrupted iterations
default   [  97% ] 80 VUs  00m13.0s/10m0s  097035/100000 shared iters
time="2025-06-05T04:22:33Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=20.34ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  7485.896106/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=10.45ms min=274.78µs med=9.08ms max=592.78ms p(90)=16.65ms p(95)=20.34ms
      { endpoint:postgres_insert }..............................................: avg=10.45ms min=274.78µs med=9.08ms max=592.78ms p(90)=16.65ms p(95)=20.34ms
      { expected_response:true }................................................: avg=10.45ms min=274.78µs med=9.08ms max=592.78ms p(90)=16.65ms p(95)=20.34ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 7485.970965/s

    EXECUTION
    iteration_duration..........................................................: avg=10.63ms min=340.15µs med=9.24ms max=598.17ms p(90)=16.95ms p(95)=20.65ms
    iterations..................................................................: 100000 7485.896106/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 689 kB/s
    data_sent...................................................................: 26 MB  1.9 MB/s



running (00m13.4s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m13.3s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-05 04:22:33] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T04:22:33Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T04:22:33Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 7515 complete and 0 interrupted iterations
default   [   8% ] 80 VUs  00m00.9s/10m0s  007515/100000 shared iters

running (00m02.0s), 80/80 VUs, 16295 complete and 0 interrupted iterations
default   [  16% ] 80 VUs  00m01.9s/10m0s  016295/100000 shared iters

running (00m03.0s), 80/80 VUs, 25620 complete and 0 interrupted iterations
default   [  26% ] 80 VUs  00m02.9s/10m0s  025620/100000 shared iters

running (00m04.0s), 80/80 VUs, 35023 complete and 0 interrupted iterations
default   [  35% ] 80 VUs  00m03.9s/10m0s  035038/100000 shared iters

running (00m05.0s), 80/80 VUs, 44635 complete and 0 interrupted iterations
default   [  45% ] 80 VUs  00m04.9s/10m0s  044635/100000 shared iters

running (00m06.0s), 80/80 VUs, 53937 complete and 0 interrupted iterations
default   [  54% ] 80 VUs  00m05.9s/10m0s  053937/100000 shared iters

running (00m07.0s), 80/80 VUs, 63482 complete and 0 interrupted iterations
default   [  63% ] 80 VUs  00m06.9s/10m0s  063482/100000 shared iters

running (00m08.0s), 80/80 VUs, 73048 complete and 0 interrupted iterations
default   [  73% ] 80 VUs  00m07.9s/10m0s  073048/100000 shared iters

running (00m09.0s), 80/80 VUs, 82659 complete and 0 interrupted iterations
default   [  83% ] 80 VUs  00m08.9s/10m0s  082660/100000 shared iters

running (00m10.0s), 80/80 VUs, 92375 complete and 0 interrupted iterations
default   [  92% ] 80 VUs  00m09.9s/10m0s  092375/100000 shared iters
time="2025-06-05T04:22:44Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T04:22:44Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=16.31ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  27850.673362/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=8.35ms min=264.13µs med=7.51ms max=52.48ms p(90)=13.45ms p(95)=16.31ms
      { endpoint:postgres_get }.............................................: avg=8.36ms min=264.13µs med=7.51ms max=52.48ms p(90)=13.46ms p(95)=16.31ms
      { expected_response:true }............................................: avg=8.35ms min=264.13µs med=7.51ms max=52.48ms p(90)=13.45ms p(95)=16.31ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 9292.934181/s

    EXECUTION
    iteration_duration......................................................: avg=8.54ms min=325.28µs med=7.65ms max=52.74ms p(90)=13.83ms p(95)=16.78ms
    iterations..............................................................: 100000 9283.557787/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  2.0 MB/s
    data_sent...............................................................: 13 MB  1.2 MB/s



running (00m10.8s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m10.7s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-05 04:22:44] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Thu Jun  5 04:22:45 UTC 2025
Duration: 12 minutes and 52 seconds
Results saved to: sysbench_results_c7g.xlarge_20250605_040953.txt
=====================================================================
[2025-06-05 04:22:45] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-05 04:22:45] Detailed results saved to: sysbench_results_c7g.xlarge_20250605_040953.txt